{"id": "ARA212Y5Y20179", "code": "ARA212Y5Y", "name": "Introductory Arabic", "description": "This course is for students who have no background knowledge in formal Arabic. The course provides students with basic information about the Arabic language paying particular attention to literacy skills, i.e. reading and writing in formal Arabic. Students start by learning how to write and pronounce the alphabet and how to connect letters to form new words. Then, they learn basic vocabulary in formal Arabic in order to express basic ideas orally and in writing. By the end of the course, students should be able to write simple sentences to express basic information, and they should be able to conduct basic conversations in formal Arabic. Everyday language in the Egyptian and Levantine accents will be provided occasionally as supplementary materials for students' information only. However, students' skills will be assessed using formal Arabic only, which is the focus of this course.[72L, 24P] NOTE: All students who are enrolling in an ARA language course for the first time (do not have the prerequisite) are required to complete a language assessment questionnaire. Students who have not completed an assessment cannot be approved for course enrolment. Please visit www.utm.utoronto.ca/language-studies/elective-languages for further details.", "division": "University of Toronto Mississauga", "department": "Language Studies", "prerequisites": "", "exclusions": "ARA210H5, ARA211H5, ARA211Y5, LGGA40H3, LGGA41H3, NMC210Y1/NML210Y1 or higher, native speakers.", "level": 200, "campus": "UTM", "term": "2017 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": [], "times": [{"day": "MONDAY", "start": 32400, "end": 39600, "duration": 7200, "location": "DH 3055"}, {"day": "WEDNESDAY", "start": 32400, "end": 36000, "duration": 3600, "location": "DH 3055"}], "size": 45, "enrolment": 13}, {"code": "P0101", "instructors": [], "times": [{"day": "WEDNESDAY", "start": 36000, "end": 39600, "duration": 3600, "location": "IB 360"}], "size": 45, "enrolment": 12}]}