{"id": "GGR420H5S20181", "code": "GGR420H5S", "name": "Geography of Finance and Financial Crisis", "description": "The global financial crisis brought to mainstream attention the important role played by finance, and new and strange terms such as subprime, derivatives, ABCP, libor, CDS, CDOs. The aftermath of crisis also witnessed mortgage foreclosures and evictions, factory closures, bailouts of large banks and hedge funds, and the implosion of public finances in a number of European nations. This course seeks to understand the spatial organization of financial flows, intermediaries, and instruments, and how these may be related to the apparently disparate phenomenon cited above. It explores how this geography of finance might be related to the production of financial crisis, and how the global geography of international finance relates to the public finances of nations and municipalities, pension and hedge funds, and individual investors. This course begins by exploring the workings of international finance, and examining the history of financial crisis, including both the current crisis and the great depression. We consider the different theories of financial crisis emanating from disparate political-economic-geographical perspectives, as well as the divergent policy implications that flow from such theories. The course then explores on the literature regarding the localized effects of the geography of finance, from the geography of sub-prime lending and foreclosures, to unemployment in selected European cities, the geography of new start-ups in developing nations, and the geography of credit card debt, bankruptcies and defaults.", "division": "University of Toronto Mississauga", "department": "Geography", "prerequisites": "Completion of third-year requirements for any Specialist or MAjor program in ENV or GGR, PI", "exclusions": "none", "level": 400, "campus": "UTM", "term": "2018 Winter", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["A Walks"], "times": [{"day": "WEDNESDAY", "start": 54000, "end": 64800, "duration": 10800, "location": "DV 1147"}], "size": 25, "enrolment": 22}]}