{"id": "JCB487Y5Y20179", "code": "JCB487Y5Y", "name": "Advanced Interdisciplinary Research Laboratory", "description": "Students will work together as members of a multidisciplinary team toward the completion of an interdisciplinary experimental or theoretical research project. Teams will be comprised of at least three students, with representation from at least three areas of specialization, namely, astronomy, biology, chemistry, earth sciences or physics. The interdisciplinary projects will be based on current trends in research and student teams will work to complete their projects with guidance provided by a team of faculty advisors from the Biology Department and the Department of Chemical and Physical Sciences. In addition to the rigorous development of research skills, the course will also provide students with training and practical experience in project management techniques and teamwork skills development. JCB487Y5 requires submitting an application to the department before the end of June, for Fall enrolment. Application forms may be found at http://uoft.me/cpsforms Application should be submitted to the CPS Undergraduate Assistant. Registration on ROSI/ACORN is also required. [240P]", "division": "University of Toronto Mississauga", "department": "Chemical and Physical Sciences", "prerequisites": "2.0 credits 300 level from BIO/CHM/JBC/JCP/ERS/ESS(G)/PHY and 1.0 credit from BIO206H5, 314H5, CHM372H5, 373H5, 394H5, 395H5, 396H5, 397H5, ERS201H5, 202H5, PHY324H5, PHY347H5. Normally taken in student's 4th year. To register in this course, students must obtain approval from the faculty member(s) who will serve as the supervisor(s) in advance of the start of the course.", "exclusions": "BIO400Y5, 481Y5, CBJ481Y5, CHM489Y5, ERS470Y5, 471H5, 472H5, PHY489Y5; BCH472Y1, 473Y1, CHM499Y1, CSB497H1, 498Y1, 499Y1, ESS491H1, 492Y1, MGY480Y1, PHY478H1, 479Y1; BIOD98Y3, CHMD90Y3, 91H3, ESSD09H3, 10H3, PSCD10H3", "level": 400, "campus": "UTM", "term": "2017 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["P Piunno"], "times": [], "size": 20, "enrolment": 8}]}