{"id": "PSYC90H3S20181", "code": "PSYC90H3S", "name": "Supervised Study in Psychology", "description": "An intensive research project intended to provide laboratory/field experience in data collection and analysis. The project must be completed over 2 consecutive terms.These courses provide an opportunity to engage in research in an area after completing basic coverage in regularly scheduled courses. The student must demonstrate a background adequate for the project proposed and should present a clear rationale to prospective supervisors. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report.Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book.Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Psychology faculty at UTSC then a secondary advisor, that is appointed at UTSC, will be required.", "division": "University of Toronto Scarborough", "department": "Psychology (UTSC)", "prerequisites": "3.0 full credits in Psychology and permission of the proposed supervisor. Note: Normally students need a cumulative GPA of at least 2.7 for permission to be granted.)", "exclusions": "COGC91H3, NROC90H3, PSY303H, PSY304H", "level": 300, "campus": "UTSC", "term": "2018 Winter", "breadths": [], "meeting_sections": [{"code": "L01", "instructors": [], "times": [], "size": 9999, "enrolment": 0}]}