{"id": "STA220H1F20175F", "code": "STA220H1F2", "name": "The Practice of Statistics I", "description": "An introductory course in statistical concepts and methods, emphasizing exploratory data analysis for univariate and bivariate data, sampling and experimental designs, basic probability models, estimation and tests of hypothesis in one-sample and comparative two-sample studies. A statistical computing package is used but no prior computing experience is assumed. (Note:STA220H1 does not count as a distribution requirement course) Section L0201 (Enrironmental Sciences) and L0301 (Health and Life Sciences) have a focus on applications in a specific area, but any section will satisfy a STA220H1 program requirement. The prerequisites are the same for all sections. This course will also be Available Online For the section available online: The online section of the course will use web-based delivery of lectures and online assessments, and will require participation in online discussions and problem solving using a range of communication tools. For one scheduled hour per week, students will participate in a live webinar. The final exam will require student attendance on the St. George campus.", "division": "Faculty of Arts and Science", "department": "Statistical Sciences", "prerequisites": "Grade 12 Mathematics and one University course in the physical, social, or life sciences", "exclusions": "ECO220Y1/ECO227Y1/GGR270H1/PSY201H1/ SOC300Y1/STA250H1/STA261H1/STA248H1/STA288H1/EEB225H1", "level": 200, "campus": "UTSG", "term": "2017 Summer F", "breadths": [5], "meeting_sections": [{"code": "L5101", "instructors": ["L Al Labadi"], "times": [{"day": "TUESDAY", "start": 64800, "end": 68400, "duration": 3600, "location": "ES 1050"}, {"day": "TUESDAY", "start": 68400, "end": 79200, "duration": 10800, "location": " ES"}, {"day": "THURSDAY", "start": 64800, "end": 68400, "duration": 3600, "location": ""}, {"day": "THURSDAY", "start": 68400, "end": 79200, "duration": 10800, "location": ""}], "size": 360, "enrolment": 0}]}