{"id": "ANT464H5F20179", "code": "ANT464H5F", "name": "The End of Coal: An Ethnographic Approach", "description": "\"Coal is Dead\" is a phrase often heard these days, and yet it is quite emphatically not. While coal prices are plunging, countries like China are currently building four coal plants a week. Even Germany, with its enticing promise of the \"Energiewende\" (Energy Transition) is building new plants and expanding old mines as it phases out nuclear energy. Coal, in other words, is increasingly declared dead even as it is decidedly undead, raising the question of what social, political, cultural, and economic processes make this so-called transition so protracted and piece-meal. Anthropology, which privileges holistic approaches to complex social problems and includes social and cultural in addition to political, economic, and technical factors in its analyses, offers unique tools for us to grasp the social life and afterlife of coal, its histories as a resource, as well as its slow death. Readings will include literature on the history of coal mining and workers' struggle, on how specific forms of resource extraction are foundational to our \"carbon democracies,\" and on how mines have today become sites of hot contestation all over the world. Taken together, this class offers a social and cultural approach to the protracted energy transition and thus ventures deeply into the rapidly emerging field of the \"energy humanities.\" There will be at least one required field trip outside of class time (weekends and/or Reading Week) with additional travel costs that students will be required to pay through ancillary fees. See Anthropology department website for more details. In some years, students may additionally have the option of participating in an international learning experience during Reading Week that will have an additional cost and application process. [24S] Limited Enrolment and Application Process: see Anthropology department website for more details.", "division": "University of Toronto Mississauga", "department": "Anthropology", "prerequisites": "ANT204, ANT206", "exclusions": "", "level": 400, "campus": "UTM", "term": "2017 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["A Muehlebach"], "times": [{"day": "WEDNESDAY", "start": 39600, "end": 46800, "duration": 7200, "location": "IB 377"}], "size": 25, "enrolment": 3}]}