{"id": "NROD98Y3Y20179", "code": "NROD98Y3Y", "name": "Thesis in Neuroscience", "description": "This course offers the opportunity to engage in a year long research project under the supervision of an interested member of the faculty in Neuroscience. The project will culminate in a written report in the form of a thesis and a poster presentation. During the course of the year, at appropriate times, students will meet to present their own research proposals, to appraise the proposals of others, and to discuss the results of their investigation. Students must first find a supervisor, which is usually confirmed before the start of the academic term in which the project will be initiated. Students will meet as a group with the coordinator as well as individually with their supervisor. Preference in this course is given to Specialists in Neuroscience with a cumulative GPA of 3.3 or higher. Students planning to pursue graduate studies are especially encouraged to enrol in the course. Students must obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and submitted to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course. Students seeking supervision off campus will need to arrange co supervision with a faculty member in Neuroscience at UTSC.", "division": "University of Toronto Scarborough", "department": "Psychology (UTSC)", "prerequisites": "Satisfactory completion of 15.0 credits in any discipline, including PSYB07H3 and one laboratory half-course in Psychology, Biology or Neuroscience and consent of a faculty member in Psychology or Biology to serve as a research supervisor. Note: Preference will be given to students in a specialist program in Neuroscience whose 15.0 credits include PSYC08H3 and who have a cumulative GPA of at least 3.3.", "exclusions": "BIOD98Y3, PSYD98Y3, (BGYD98Y3), (BGYD99Y3), (BGYD01Y3), (BGYD02Y3)", "level": 400, "campus": "UTSC", "term": "2017 Fall", "breadths": [], "meeting_sections": [{"code": "L01", "instructors": ["S Erb"], "times": [{"day": "FRIDAY", "start": 46800, "end": 54000, "duration": 7200, "location": "AA 204"}], "size": 15, "enrolment": 0}]}