{"id": "PSYD98Y3Y20179", "code": "PSYD98Y3Y", "name": "Thesis in Psychology", "description": "This course offers the opportunity to engage in a year long research project under the supervision of an interested member of the faculty in Psychology. The project will culminate in a written report in the form of a thesis and a poster presentation. During the course of the year, at appropriate times, students will meet to present their own research proposals, to appraise the proposals of others, and to discuss the results of their investigation. Students must first find a supervisor, which is usually confirmed before the start of the academic term in which the project will be initiated. Students will meet as a group with the coordinator as well as individually with their supervisor. This course is restricted to Specialists in Psychology and Mental Health Studies with a cumulative GPA of 3.3 or higher. Students planning to pursue graduate studies are especially encouraged to enrol in the course. Students must obtain a permission form from the Psychology departmental website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and submitted to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course. Students seeking supervision off campus will need to arrange co-supervision with a faculty member in Psychology at this campus.", "division": "University of Toronto Scarborough", "department": "Psychology (UTSC)", "prerequisites": "PSYB01H3 and PSYB07H3 and PSYC08H3, Psychology or Mental Health Studies Specialist, cumulative GPA of 3.3 or higher. Note: Registration in D-level courses on ROSI is tentative. This is to ensure spaces in these courses for students who need them to graduate at the end of the current session. ROSI will show your status in the course and its final confirmation.", "exclusions": "NROD98Y3, COGD10H3, PSY400Y", "level": 400, "campus": "UTSC", "term": "2017 Fall", "breadths": [], "meeting_sections": [{"code": "L01", "instructors": ["S Erb"], "times": [{"day": "FRIDAY", "start": 46800, "end": 54000, "duration": 7200, "location": "AA 204"}], "size": 25, "enrolment": 0}]}